branches/Degreasing/src/packages/Factiva.Gateway.Resources.7.5.0.83/content/GatewayResources/stubs/RTQueue/SubscribeToQueueFeed.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Header><controlData xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="urn:factiva:fcs:v1_0"><token name="userID">joyful</token><token name="userPassword">joyful</token><token name="productID">16</token></controlData></soap-env:Header><soap-env:Body><SubscribeToQueueFeed xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="urn:emg:RTQReqMgr:v1_0"><queueContext>63_1001_001_27138ZzZINAUQT2TAAAGUAQAAAAACU27AAAAAABSGAYDSMBSGAZTAOBTHAYDIOBZ_20090203101010000</queueContext><feedType>Alert</feedType><feedDetails xsi:type="RealTimeAlertDetails"><searchString>IBM</searchString></feedDetails></SubscribeToQueueFeed></soap-env:Body></soap-env:Envelope>